Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/bootloader/pic32cx_mtsh_db/src/packs/PIC32CX2051MTSH128_DFP/component/pmc.h
/*
 * Component description for PMC
 *
 * Copyright (c) 2023 Microchip Technology Inc. and its subsidiaries.
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 */

/* file generated from device description file (ATDF) version 2023-12-19T08:59:38Z */
#ifndef _PIC32CXMTSH_PMC_COMPONENT_H_
#define _PIC32CXMTSH_PMC_COMPONENT_H_

/* ************************************************************************** */
/*   SOFTWARE API DEFINITION FOR PMC                                          */
/* ************************************************************************** */

/* -------- PMC_SCER : (PMC Offset: 0x00) ( /W 32) System Clock Enable Register -------- */
#define PMC_SCER_PCK0_Pos                     _UINT32_(8)                                          /* (PMC_SCER) Programmable Clock 0 Output Enable Position */
#define PMC_SCER_PCK0_Msk                     (_UINT32_(0x1) << PMC_SCER_PCK0_Pos)                 /* (PMC_SCER) Programmable Clock 0 Output Enable Mask */
#define PMC_SCER_PCK0(value)                  (PMC_SCER_PCK0_Msk & (_UINT32_(value) << PMC_SCER_PCK0_Pos)) /* Assigment of value for PCK0 in the PMC_SCER register */
#define PMC_SCER_PCK1_Pos                     _UINT32_(9)                                          /* (PMC_SCER) Programmable Clock 1 Output Enable Position */
#define PMC_SCER_PCK1_Msk                     (_UINT32_(0x1) << PMC_SCER_PCK1_Pos)                 /* (PMC_SCER) Programmable Clock 1 Output Enable Mask */
#define PMC_SCER_PCK1(value)                  (PMC_SCER_PCK1_Msk & (_UINT32_(value) << PMC_SCER_PCK1_Pos)) /* Assigment of value for PCK1 in the PMC_SCER register */
#define PMC_SCER_PCK2_Pos                     _UINT32_(10)                                         /* (PMC_SCER) Programmable Clock 2 Output Enable Position */
#define PMC_SCER_PCK2_Msk                     (_UINT32_(0x1) << PMC_SCER_PCK2_Pos)                 /* (PMC_SCER) Programmable Clock 2 Output Enable Mask */
#define PMC_SCER_PCK2(value)                  (PMC_SCER_PCK2_Msk & (_UINT32_(value) << PMC_SCER_PCK2_Pos)) /* Assigment of value for PCK2 in the PMC_SCER register */
#define PMC_SCER_PCK3_Pos                     _UINT32_(11)                                         /* (PMC_SCER) Programmable Clock 3 Output Enable Position */
#define PMC_SCER_PCK3_Msk                     (_UINT32_(0x1) << PMC_SCER_PCK3_Pos)                 /* (PMC_SCER) Programmable Clock 3 Output Enable Mask */
#define PMC_SCER_PCK3(value)                  (PMC_SCER_PCK3_Msk & (_UINT32_(value) << PMC_SCER_PCK3_Pos)) /* Assigment of value for PCK3 in the PMC_SCER register */
#define PMC_SCER_CPCK_Pos                     _UINT32_(16)                                         /* (PMC_SCER) Coprocessor (Second Processor) Clocks Enable Position */
#define PMC_SCER_CPCK_Msk                     (_UINT32_(0x1) << PMC_SCER_CPCK_Pos)                 /* (PMC_SCER) Coprocessor (Second Processor) Clocks Enable Mask */
#define PMC_SCER_CPCK(value)                  (PMC_SCER_CPCK_Msk & (_UINT32_(value) << PMC_SCER_CPCK_Pos)) /* Assigment of value for CPCK in the PMC_SCER register */
#define PMC_SCER_CPBMCK_Pos                   _UINT32_(17)                                         /* (PMC_SCER) Coprocessor Bus Master Clocks Enable Position */
#define PMC_SCER_CPBMCK_Msk                   (_UINT32_(0x1) << PMC_SCER_CPBMCK_Pos)               /* (PMC_SCER) Coprocessor Bus Master Clocks Enable Mask */
#define PMC_SCER_CPBMCK(value)                (PMC_SCER_CPBMCK_Msk & (_UINT32_(value) << PMC_SCER_CPBMCK_Pos)) /* Assigment of value for CPBMCK in the PMC_SCER register */
#define PMC_SCER_CPKEY_Pos                    _UINT32_(20)                                         /* (PMC_SCER) Coprocessor Clocks Enable Key Position */
#define PMC_SCER_CPKEY_Msk                    (_UINT32_(0xF) << PMC_SCER_CPKEY_Pos)                /* (PMC_SCER) Coprocessor Clocks Enable Key Mask */
#define PMC_SCER_CPKEY(value)                 (PMC_SCER_CPKEY_Msk & (_UINT32_(value) << PMC_SCER_CPKEY_Pos)) /* Assigment of value for CPKEY in the PMC_SCER register */
#define   PMC_SCER_CPKEY_PASSWD_Val           _UINT32_(0xA)                                        /* (PMC_SCER) This field must be written to 0xA to validate CPBMCK and CPCK.  */
#define PMC_SCER_CPKEY_PASSWD                 (PMC_SCER_CPKEY_PASSWD_Val << PMC_SCER_CPKEY_Pos)    /* (PMC_SCER) This field must be written to 0xA to validate CPBMCK and CPCK. Position  */
#define PMC_SCER_Msk                          _UINT32_(0x00F30F00)                                 /* (PMC_SCER) Register Mask  */

#define PMC_SCER_PCK_Pos                      _UINT32_(8)                                          /* (PMC_SCER Position) Programmable Clock x Output Enable */
#define PMC_SCER_PCK_Msk                      (_UINT32_(0xF) << PMC_SCER_PCK_Pos)                  /* (PMC_SCER Mask) PCK */
#define PMC_SCER_PCK(value)                   (PMC_SCER_PCK_Msk & (_UINT32_(value) << PMC_SCER_PCK_Pos)) 

/* -------- PMC_SCDR : (PMC Offset: 0x04) ( /W 32) System Clock Disable Register -------- */
#define PMC_SCDR_PCK0_Pos                     _UINT32_(8)                                          /* (PMC_SCDR) Programmable Clock 0 Output Disable Position */
#define PMC_SCDR_PCK0_Msk                     (_UINT32_(0x1) << PMC_SCDR_PCK0_Pos)                 /* (PMC_SCDR) Programmable Clock 0 Output Disable Mask */
#define PMC_SCDR_PCK0(value)                  (PMC_SCDR_PCK0_Msk & (_UINT32_(value) << PMC_SCDR_PCK0_Pos)) /* Assigment of value for PCK0 in the PMC_SCDR register */
#define PMC_SCDR_PCK1_Pos                     _UINT32_(9)                                          /* (PMC_SCDR) Programmable Clock 1 Output Disable Position */
#define PMC_SCDR_PCK1_Msk                     (_UINT32_(0x1) << PMC_SCDR_PCK1_Pos)                 /* (PMC_SCDR) Programmable Clock 1 Output Disable Mask */
#define PMC_SCDR_PCK1(value)                  (PMC_SCDR_PCK1_Msk & (_UINT32_(value) << PMC_SCDR_PCK1_Pos)) /* Assigment of value for PCK1 in the PMC_SCDR register */
#define PMC_SCDR_PCK2_Pos                     _UINT32_(10)                                         /* (PMC_SCDR) Programmable Clock 2 Output Disable Position */
#define PMC_SCDR_PCK2_Msk                     (_UINT32_(0x1) << PMC_SCDR_PCK2_Pos)                 /* (PMC_SCDR) Programmable Clock 2 Output Disable Mask */
#define PMC_SCDR_PCK2(value)                  (PMC_SCDR_PCK2_Msk & (_UINT32_(value) << PMC_SCDR_PCK2_Pos)) /* Assigment of value for PCK2 in the PMC_SCDR register */
#define PMC_SCDR_PCK3_Pos                     _UINT32_(11)                                         /* (PMC_SCDR) Programmable Clock 3 Output Disable Position */
#define PMC_SCDR_PCK3_Msk                     (_UINT32_(0x1) << PMC_SCDR_PCK3_Pos)                 /* (PMC_SCDR) Programmable Clock 3 Output Disable Mask */
#define PMC_SCDR_PCK3(value)                  (PMC_SCDR_PCK3_Msk & (_UINT32_(value) << PMC_SCDR_PCK3_Pos)) /* Assigment of value for PCK3 in the PMC_SCDR register */
#define PMC_SCDR_CPCK_Pos                     _UINT32_(16)                                         /* (PMC_SCDR) Coprocessor (Second Processor) Clocks Disable Position */
#define PMC_SCDR_CPCK_Msk                     (_UINT32_(0x1) << PMC_SCDR_CPCK_Pos)                 /* (PMC_SCDR) Coprocessor (Second Processor) Clocks Disable Mask */
#define PMC_SCDR_CPCK(value)                  (PMC_SCDR_CPCK_Msk & (_UINT32_(value) << PMC_SCDR_CPCK_Pos)) /* Assigment of value for CPCK in the PMC_SCDR register */
#define PMC_SCDR_CPBMCK_Pos                   _UINT32_(17)                                         /* (PMC_SCDR) Coprocessor Bus Master Clocks Disable Position */
#define PMC_SCDR_CPBMCK_Msk                   (_UINT32_(0x1) << PMC_SCDR_CPBMCK_Pos)               /* (PMC_SCDR) Coprocessor Bus Master Clocks Disable Mask */
#define PMC_SCDR_CPBMCK(value)                (PMC_SCDR_CPBMCK_Msk & (_UINT32_(value) << PMC_SCDR_CPBMCK_Pos)) /* Assigment of value for CPBMCK in the PMC_SCDR register */
#define PMC_SCDR_CPKEY_Pos                    _UINT32_(20)                                         /* (PMC_SCDR) Coprocessor Clocks Enable Key Position */
#define PMC_SCDR_CPKEY_Msk                    (_UINT32_(0xF) << PMC_SCDR_CPKEY_Pos)                /* (PMC_SCDR) Coprocessor Clocks Enable Key Mask */
#define PMC_SCDR_CPKEY(value)                 (PMC_SCDR_CPKEY_Msk & (_UINT32_(value) << PMC_SCDR_CPKEY_Pos)) /* Assigment of value for CPKEY in the PMC_SCDR register */
#define   PMC_SCDR_CPKEY_PASSWD_Val           _UINT32_(0xA)                                        /* (PMC_SCDR) This field must be written to 0xA to validate CPBMCK and CPCK.  */
#define PMC_SCDR_CPKEY_PASSWD                 (PMC_SCDR_CPKEY_PASSWD_Val << PMC_SCDR_CPKEY_Pos)    /* (PMC_SCDR) This field must be written to 0xA to validate CPBMCK and CPCK. Position  */
#define PMC_SCDR_Msk                          _UINT32_(0x00F30F00)                                 /* (PMC_SCDR) Register Mask  */

