Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/bootloader/pic32cx_mtsh_db/src/packs/PIC32CX2051MTSH128_DFP/component/pmc.h
#define PMC_SCDR_PCK_Pos                      _UINT32_(8)                                          /* (PMC_SCDR Position) Programmable Clock x Output Disable */
#define PMC_SCDR_PCK_Msk                      (_UINT32_(0xF) << PMC_SCDR_PCK_Pos)                  /* (PMC_SCDR Mask) PCK */
#define PMC_SCDR_PCK(value)                   (PMC_SCDR_PCK_Msk & (_UINT32_(value) << PMC_SCDR_PCK_Pos)) 

/* -------- PMC_SCSR : (PMC Offset: 0x08) ( R/ 32) System Clock Status Register -------- */
#define PMC_SCSR_CPU_CLK0S_Pos                _UINT32_(0)                                          /* (PMC_SCSR) CPU_CLK Status for Core 0 Position */
#define PMC_SCSR_CPU_CLK0S_Msk                (_UINT32_(0x1) << PMC_SCSR_CPU_CLK0S_Pos)            /* (PMC_SCSR) CPU_CLK Status for Core 0 Mask */
#define PMC_SCSR_CPU_CLK0S(value)             (PMC_SCSR_CPU_CLK0S_Msk & (_UINT32_(value) << PMC_SCSR_CPU_CLK0S_Pos)) /* Assigment of value for CPU_CLK0S in the PMC_SCSR register */
#define PMC_SCSR_CPU_CLK1S_Pos                _UINT32_(1)                                          /* (PMC_SCSR) CPU_CLK Status for Core 1 Position */
#define PMC_SCSR_CPU_CLK1S_Msk                (_UINT32_(0x1) << PMC_SCSR_CPU_CLK1S_Pos)            /* (PMC_SCSR) CPU_CLK Status for Core 1 Mask */
#define PMC_SCSR_CPU_CLK1S(value)             (PMC_SCSR_CPU_CLK1S_Msk & (_UINT32_(value) << PMC_SCSR_CPU_CLK1S_Pos)) /* Assigment of value for CPU_CLK1S in the PMC_SCSR register */
#define PMC_SCSR_PCK0_Pos                     _UINT32_(8)                                          /* (PMC_SCSR) Programmable Clock 0 Output Status Position */
#define PMC_SCSR_PCK0_Msk                     (_UINT32_(0x1) << PMC_SCSR_PCK0_Pos)                 /* (PMC_SCSR) Programmable Clock 0 Output Status Mask */
#define PMC_SCSR_PCK0(value)                  (PMC_SCSR_PCK0_Msk & (_UINT32_(value) << PMC_SCSR_PCK0_Pos)) /* Assigment of value for PCK0 in the PMC_SCSR register */
#define PMC_SCSR_PCK1_Pos                     _UINT32_(9)                                          /* (PMC_SCSR) Programmable Clock 1 Output Status Position */
#define PMC_SCSR_PCK1_Msk                     (_UINT32_(0x1) << PMC_SCSR_PCK1_Pos)                 /* (PMC_SCSR) Programmable Clock 1 Output Status Mask */
#define PMC_SCSR_PCK1(value)                  (PMC_SCSR_PCK1_Msk & (_UINT32_(value) << PMC_SCSR_PCK1_Pos)) /* Assigment of value for PCK1 in the PMC_SCSR register */
#define PMC_SCSR_PCK2_Pos                     _UINT32_(10)                                         /* (PMC_SCSR) Programmable Clock 2 Output Status Position */
#define PMC_SCSR_PCK2_Msk                     (_UINT32_(0x1) << PMC_SCSR_PCK2_Pos)                 /* (PMC_SCSR) Programmable Clock 2 Output Status Mask */
#define PMC_SCSR_PCK2(value)                  (PMC_SCSR_PCK2_Msk & (_UINT32_(value) << PMC_SCSR_PCK2_Pos)) /* Assigment of value for PCK2 in the PMC_SCSR register */
#define PMC_SCSR_PCK3_Pos                     _UINT32_(11)                                         /* (PMC_SCSR) Programmable Clock 3 Output Status Position */
#define PMC_SCSR_PCK3_Msk                     (_UINT32_(0x1) << PMC_SCSR_PCK3_Pos)                 /* (PMC_SCSR) Programmable Clock 3 Output Status Mask */
#define PMC_SCSR_PCK3(value)                  (PMC_SCSR_PCK3_Msk & (_UINT32_(value) << PMC_SCSR_PCK3_Pos)) /* Assigment of value for PCK3 in the PMC_SCSR register */
#define PMC_SCSR_CPCK_Pos                     _UINT32_(16)                                         /* (PMC_SCSR) Coprocessor (Second Processor) Clocks Status Position */
#define PMC_SCSR_CPCK_Msk                     (_UINT32_(0x1) << PMC_SCSR_CPCK_Pos)                 /* (PMC_SCSR) Coprocessor (Second Processor) Clocks Status Mask */
#define PMC_SCSR_CPCK(value)                  (PMC_SCSR_CPCK_Msk & (_UINT32_(value) << PMC_SCSR_CPCK_Pos)) /* Assigment of value for CPCK in the PMC_SCSR register */
#define PMC_SCSR_CPBMCK_Pos                   _UINT32_(17)                                         /* (PMC_SCSR) Coprocessor Bus Master Clocks Status Position */
#define PMC_SCSR_CPBMCK_Msk                   (_UINT32_(0x1) << PMC_SCSR_CPBMCK_Pos)               /* (PMC_SCSR) Coprocessor Bus Master Clocks Status Mask */
#define PMC_SCSR_CPBMCK(value)                (PMC_SCSR_CPBMCK_Msk & (_UINT32_(value) << PMC_SCSR_CPBMCK_Pos)) /* Assigment of value for CPBMCK in the PMC_SCSR register */
#define PMC_SCSR_Msk                          _UINT32_(0x00030F03)                                 /* (PMC_SCSR) Register Mask  */

#define PMC_SCSR_PCK_Pos                      _UINT32_(8)                                          /* (PMC_SCSR Position) Programmable Clock x Output Status */
#define PMC_SCSR_PCK_Msk                      (_UINT32_(0xF) << PMC_SCSR_PCK_Pos)                  /* (PMC_SCSR Mask) PCK */
#define PMC_SCSR_PCK(value)                   (PMC_SCSR_PCK_Msk & (_UINT32_(value) << PMC_SCSR_PCK_Pos)) 

/* -------- PMC_PLL_CTRL0 : (PMC Offset: 0x0C) (R/W 32) PLL Control Register 0 -------- */
#define PMC_PLL_CTRL0_DIVPMC0_Pos             _UINT32_(0)                                          /* (PMC_PLL_CTRL0) Divider for PMC output 0 Position */
#define PMC_PLL_CTRL0_DIVPMC0_Msk             (_UINT32_(0xFF) << PMC_PLL_CTRL0_DIVPMC0_Pos)        /* (PMC_PLL_CTRL0) Divider for PMC output 0 Mask */
#define PMC_PLL_CTRL0_DIVPMC0(value)          (PMC_PLL_CTRL0_DIVPMC0_Msk & (_UINT32_(value) << PMC_PLL_CTRL0_DIVPMC0_Pos)) /* Assigment of value for DIVPMC0 in the PMC_PLL_CTRL0 register */
#define PMC_PLL_CTRL0_DIVPMC1_Pos             _UINT32_(12)                                         /* (PMC_PLL_CTRL0) Divider for PMC output 1 (PLLA only) Position */
#define PMC_PLL_CTRL0_DIVPMC1_Msk             (_UINT32_(0xFF) << PMC_PLL_CTRL0_DIVPMC1_Pos)        /* (PMC_PLL_CTRL0) Divider for PMC output 1 (PLLA only) Mask */
#define PMC_PLL_CTRL0_DIVPMC1(value)          (PMC_PLL_CTRL0_DIVPMC1_Msk & (_UINT32_(value) << PMC_PLL_CTRL0_DIVPMC1_Pos)) /* Assigment of value for DIVPMC1 in the PMC_PLL_CTRL0 register */
#define PMC_PLL_CTRL0_PLLMS_Pos               _UINT32_(27)                                         /* (PMC_PLL_CTRL0) PLL Multiplexer Select Position */
#define PMC_PLL_CTRL0_PLLMS_Msk               (_UINT32_(0x1) << PMC_PLL_CTRL0_PLLMS_Pos)           /* (PMC_PLL_CTRL0) PLL Multiplexer Select Mask */
#define PMC_PLL_CTRL0_PLLMS(value)            (PMC_PLL_CTRL0_PLLMS_Msk & (_UINT32_(value) << PMC_PLL_CTRL0_PLLMS_Pos)) /* Assigment of value for PLLMS in the PMC_PLL_CTRL0 register */
#define PMC_PLL_CTRL0_ENPLL_Pos               _UINT32_(28)                                         /* (PMC_PLL_CTRL0) Enable PLL Position */
#define PMC_PLL_CTRL0_ENPLL_Msk               (_UINT32_(0x1) << PMC_PLL_CTRL0_ENPLL_Pos)           /* (PMC_PLL_CTRL0) Enable PLL Mask */
#define PMC_PLL_CTRL0_ENPLL(value)            (PMC_PLL_CTRL0_ENPLL_Msk & (_UINT32_(value) << PMC_PLL_CTRL0_ENPLL_Pos)) /* Assigment of value for ENPLL in the PMC_PLL_CTRL0 register */
#define PMC_PLL_CTRL0_ENPLLO0_Pos             _UINT32_(29)                                         /* (PMC_PLL_CTRL0) Enable PLL Clock Output 0 Position */
#define PMC_PLL_CTRL0_ENPLLO0_Msk             (_UINT32_(0x1) << PMC_PLL_CTRL0_ENPLLO0_Pos)         /* (PMC_PLL_CTRL0) Enable PLL Clock Output 0 Mask */
#define PMC_PLL_CTRL0_ENPLLO0(value)          (PMC_PLL_CTRL0_ENPLLO0_Msk & (_UINT32_(value) << PMC_PLL_CTRL0_ENPLLO0_Pos)) /* Assigment of value for ENPLLO0 in the PMC_PLL_CTRL0 register */
#define PMC_PLL_CTRL0_ENPLLO1_Pos             _UINT32_(30)                                         /* (PMC_PLL_CTRL0) Enable PLL Clock Output 1 (PLLA only) Position */
#define PMC_PLL_CTRL0_ENPLLO1_Msk             (_UINT32_(0x1) << PMC_PLL_CTRL0_ENPLLO1_Pos)         /* (PMC_PLL_CTRL0) Enable PLL Clock Output 1 (PLLA only) Mask */
#define PMC_PLL_CTRL0_ENPLLO1(value)          (PMC_PLL_CTRL0_ENPLLO1_Msk & (_UINT32_(value) << PMC_PLL_CTRL0_ENPLLO1_Pos)) /* Assigment of value for ENPLLO1 in the PMC_PLL_CTRL0 register */
#define PMC_PLL_CTRL0_ENLOCK_Pos              _UINT32_(31)                                         /* (PMC_PLL_CTRL0) Enable PLL Lock Position */
#define PMC_PLL_CTRL0_ENLOCK_Msk              (_UINT32_(0x1) << PMC_PLL_CTRL0_ENLOCK_Pos)          /* (PMC_PLL_CTRL0) Enable PLL Lock Mask */
#define PMC_PLL_CTRL0_ENLOCK(value)           (PMC_PLL_CTRL0_ENLOCK_Msk & (_UINT32_(value) << PMC_PLL_CTRL0_ENLOCK_Pos)) /* Assigment of value for ENLOCK in the PMC_PLL_CTRL0 register */
#define PMC_PLL_CTRL0_Msk                     _UINT32_(0xF80FF0FF)                                 /* (PMC_PLL_CTRL0) Register Mask  */

