Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/bootloader/pic32cx_mtsh_db/src/packs/PIC32CX2051MTSH128_DFP/component/pmc.h
/* -------- CKGR_MCFR : (PMC Offset: 0x28) (R/W 32) Main Clock Frequency Register -------- */
#define CKGR_MCFR_MAINF_Pos                   _UINT32_(0)                                          /* (CKGR_MCFR) Main Clock Frequency Position */
#define CKGR_MCFR_MAINF_Msk                   (_UINT32_(0xFFFF) << CKGR_MCFR_MAINF_Pos)            /* (CKGR_MCFR) Main Clock Frequency Mask */
#define CKGR_MCFR_MAINF(value)                (CKGR_MCFR_MAINF_Msk & (_UINT32_(value) << CKGR_MCFR_MAINF_Pos)) /* Assigment of value for MAINF in the CKGR_MCFR register */
#define CKGR_MCFR_MAINFRDY_Pos                _UINT32_(16)                                         /* (CKGR_MCFR) Main Clock Frequency Measure Ready Position */
#define CKGR_MCFR_MAINFRDY_Msk                (_UINT32_(0x1) << CKGR_MCFR_MAINFRDY_Pos)            /* (CKGR_MCFR) Main Clock Frequency Measure Ready Mask */
#define CKGR_MCFR_MAINFRDY(value)             (CKGR_MCFR_MAINFRDY_Msk & (_UINT32_(value) << CKGR_MCFR_MAINFRDY_Pos)) /* Assigment of value for MAINFRDY in the CKGR_MCFR register */
#define CKGR_MCFR_RCMEAS_Pos                  _UINT32_(20)                                         /* (CKGR_MCFR) RC Oscillator Frequency Measure (write-only) Position */
#define CKGR_MCFR_RCMEAS_Msk                  (_UINT32_(0x1) << CKGR_MCFR_RCMEAS_Pos)              /* (CKGR_MCFR) RC Oscillator Frequency Measure (write-only) Mask */
#define CKGR_MCFR_RCMEAS(value)               (CKGR_MCFR_RCMEAS_Msk & (_UINT32_(value) << CKGR_MCFR_RCMEAS_Pos)) /* Assigment of value for RCMEAS in the CKGR_MCFR register */
#define CKGR_MCFR_CCSS_Pos                    _UINT32_(24)                                         /* (CKGR_MCFR) Counter Clock Source Selection Position */
#define CKGR_MCFR_CCSS_Msk                    (_UINT32_(0x1) << CKGR_MCFR_CCSS_Pos)                /* (CKGR_MCFR) Counter Clock Source Selection Mask */
#define CKGR_MCFR_CCSS(value)                 (CKGR_MCFR_CCSS_Msk & (_UINT32_(value) << CKGR_MCFR_CCSS_Pos)) /* Assigment of value for CCSS in the CKGR_MCFR register */
#define CKGR_MCFR_Msk                         _UINT32_(0x0111FFFF)                                 /* (CKGR_MCFR) Register Mask  */


/* -------- PMC_CPU_CKR : (PMC Offset: 0x2C) (R/W 32) CPU Clock Register -------- */
#define PMC_CPU_CKR_CSS_Pos                   _UINT32_(0)                                          /* (PMC_CPU_CKR) Processor (CPU_CLK0) and Master Clock (MCK0) Source Selection Position */
#define PMC_CPU_CKR_CSS_Msk                   (_UINT32_(0x3) << PMC_CPU_CKR_CSS_Pos)               /* (PMC_CPU_CKR) Processor (CPU_CLK0) and Master Clock (MCK0) Source Selection Mask */
#define PMC_CPU_CKR_CSS(value)                (PMC_CPU_CKR_CSS_Msk & (_UINT32_(value) << PMC_CPU_CKR_CSS_Pos)) /* Assigment of value for CSS in the PMC_CPU_CKR register */
#define   PMC_CPU_CKR_CSS_MD_SLOW_CLK_Val     _UINT32_(0x0)                                        /* (PMC_CPU_CKR) MD_SLCK is selected  */
#define   PMC_CPU_CKR_CSS_MAINCK_Val          _UINT32_(0x1)                                        /* (PMC_CPU_CKR) MAINCK is selected  */
#define   PMC_CPU_CKR_CSS_PLLACK1_Val         _UINT32_(0x2)                                        /* (PMC_CPU_CKR) PLLACK1 is selected  */
#define   PMC_CPU_CKR_CSS_PLLBCK_Val          _UINT32_(0x3)                                        /* (PMC_CPU_CKR) PLLBCK is selected  */
#define PMC_CPU_CKR_CSS_MD_SLOW_CLK           (PMC_CPU_CKR_CSS_MD_SLOW_CLK_Val << PMC_CPU_CKR_CSS_Pos) /* (PMC_CPU_CKR) MD_SLCK is selected Position  */
#define PMC_CPU_CKR_CSS_MAINCK                (PMC_CPU_CKR_CSS_MAINCK_Val << PMC_CPU_CKR_CSS_Pos)  /* (PMC_CPU_CKR) MAINCK is selected Position  */
#define PMC_CPU_CKR_CSS_PLLACK1               (PMC_CPU_CKR_CSS_PLLACK1_Val << PMC_CPU_CKR_CSS_Pos) /* (PMC_CPU_CKR) PLLACK1 is selected Position  */
#define PMC_CPU_CKR_CSS_PLLBCK                (PMC_CPU_CKR_CSS_PLLBCK_Val << PMC_CPU_CKR_CSS_Pos)  /* (PMC_CPU_CKR) PLLBCK is selected Position  */
#define PMC_CPU_CKR_PRES_Pos                  _UINT32_(4)                                          /* (PMC_CPU_CKR) Processor (CPU_CLK0) and Master Clock (MCK0) Prescaler Position */
#define PMC_CPU_CKR_PRES_Msk                  (_UINT32_(0x7) << PMC_CPU_CKR_PRES_Pos)              /* (PMC_CPU_CKR) Processor (CPU_CLK0) and Master Clock (MCK0) Prescaler Mask */
#define PMC_CPU_CKR_PRES(value)               (PMC_CPU_CKR_PRES_Msk & (_UINT32_(value) << PMC_CPU_CKR_PRES_Pos)) /* Assigment of value for PRES in the PMC_CPU_CKR register */
#define   PMC_CPU_CKR_PRES_CLK_1_Val          _UINT32_(0x0)                                        /* (PMC_CPU_CKR) Selected clock  */
#define   PMC_CPU_CKR_PRES_CLK_2_Val          _UINT32_(0x1)                                        /* (PMC_CPU_CKR) Selected clock divided by 2  */
#define   PMC_CPU_CKR_PRES_CLK_4_Val          _UINT32_(0x2)                                        /* (PMC_CPU_CKR) Selected clock divided by 4  */
#define   PMC_CPU_CKR_PRES_CLK_8_Val          _UINT32_(0x3)                                        /* (PMC_CPU_CKR) Selected clock divided by 8  */
#define   PMC_CPU_CKR_PRES_CLK_16_Val         _UINT32_(0x4)                                        /* (PMC_CPU_CKR) Selected clock divided by 16  */
#define   PMC_CPU_CKR_PRES_CLK_32_Val         _UINT32_(0x5)                                        /* (PMC_CPU_CKR) Selected clock divided by 32  */
#define   PMC_CPU_CKR_PRES_CLK_64_Val         _UINT32_(0x6)                                        /* (PMC_CPU_CKR) Selected clock divided by 64  */
#define   PMC_CPU_CKR_PRES_CLK_3_Val          _UINT32_(0x7)                                        /* (PMC_CPU_CKR) Selected clock divided by 3  */
#define PMC_CPU_CKR_PRES_CLK_1                (PMC_CPU_CKR_PRES_CLK_1_Val << PMC_CPU_CKR_PRES_Pos) /* (PMC_CPU_CKR) Selected clock Position  */
#define PMC_CPU_CKR_PRES_CLK_2                (PMC_CPU_CKR_PRES_CLK_2_Val << PMC_CPU_CKR_PRES_Pos) /* (PMC_CPU_CKR) Selected clock divided by 2 Position  */
#define PMC_CPU_CKR_PRES_CLK_4                (PMC_CPU_CKR_PRES_CLK_4_Val << PMC_CPU_CKR_PRES_Pos) /* (PMC_CPU_CKR) Selected clock divided by 4 Position  */
#define PMC_CPU_CKR_PRES_CLK_8                (PMC_CPU_CKR_PRES_CLK_8_Val << PMC_CPU_CKR_PRES_Pos) /* (PMC_CPU_CKR) Selected clock divided by 8 Position  */
#define PMC_CPU_CKR_PRES_CLK_16               (PMC_CPU_CKR_PRES_CLK_16_Val << PMC_CPU_CKR_PRES_Pos) /* (PMC_CPU_CKR) Selected clock divided by 16 Position  */
#define PMC_CPU_CKR_PRES_CLK_32               (PMC_CPU_CKR_PRES_CLK_32_Val << PMC_CPU_CKR_PRES_Pos) /* (PMC_CPU_CKR) Selected clock divided by 32 Position  */
#define PMC_CPU_CKR_PRES_CLK_64               (PMC_CPU_CKR_PRES_CLK_64_Val << PMC_CPU_CKR_PRES_Pos) /* (PMC_CPU_CKR) Selected clock divided by 64 Position  */
#define PMC_CPU_CKR_PRES_CLK_3                (PMC_CPU_CKR_PRES_CLK_3_Val << PMC_CPU_CKR_PRES_Pos) /* (PMC_CPU_CKR) Selected clock divided by 3 Position  */
#define PMC_CPU_CKR_CPCSS_Pos                 _UINT32_(16)                                         /* (PMC_CPU_CKR) Coprocessor MCK1 Source Selection Position */
#define PMC_CPU_CKR_CPCSS_Msk                 (_UINT32_(0x7) << PMC_CPU_CKR_CPCSS_Pos)             /* (PMC_CPU_CKR) Coprocessor MCK1 Source Selection Mask */
#define PMC_CPU_CKR_CPCSS(value)              (PMC_CPU_CKR_CPCSS_Msk & (_UINT32_(value) << PMC_CPU_CKR_CPCSS_Pos)) /* Assigment of value for CPCSS in the PMC_CPU_CKR register */
#define   PMC_CPU_CKR_CPCSS_MD_SLOW_CLK_Val   _UINT32_(0x0)                                        /* (PMC_CPU_CKR) MD_SLCK is selected  */
#define   PMC_CPU_CKR_CPCSS_MAINCK_Val        _UINT32_(0x1)                                        /* (PMC_CPU_CKR) MAINCK is selected  */
#define   PMC_CPU_CKR_CPCSS_MCK0_Val          _UINT32_(0x2)                                        /* (PMC_CPU_CKR) MCK0 is selected  */
#define   PMC_CPU_CKR_CPCSS_PLLACK1_Val       _UINT32_(0x3)                                        /* (PMC_CPU_CKR) PLLACK1 is selected  */
#define   PMC_CPU_CKR_CPCSS_PLLBCK_Val        _UINT32_(0x4)                                        /* (PMC_CPU_CKR) PLLBCK is selected  */
#define   PMC_CPU_CKR_CPCSS_PLLCCK_Val        _UINT32_(0x5)                                        /* (PMC_CPU_CKR) PLLCCK is selected  */
#define PMC_CPU_CKR_CPCSS_MD_SLOW_CLK         (PMC_CPU_CKR_CPCSS_MD_SLOW_CLK_Val << PMC_CPU_CKR_CPCSS_Pos) /* (PMC_CPU_CKR) MD_SLCK is selected Position  */
#define PMC_CPU_CKR_CPCSS_MAINCK              (PMC_CPU_CKR_CPCSS_MAINCK_Val << PMC_CPU_CKR_CPCSS_Pos) /* (PMC_CPU_CKR) MAINCK is selected Position  */
#define PMC_CPU_CKR_CPCSS_MCK0                (PMC_CPU_CKR_CPCSS_MCK0_Val << PMC_CPU_CKR_CPCSS_Pos) /* (PMC_CPU_CKR) MCK0 is selected Position  */
#define PMC_CPU_CKR_CPCSS_PLLACK1             (PMC_CPU_CKR_CPCSS_PLLACK1_Val << PMC_CPU_CKR_CPCSS_Pos) /* (PMC_CPU_CKR) PLLACK1 is selected Position  */
#define PMC_CPU_CKR_CPCSS_PLLBCK              (PMC_CPU_CKR_CPCSS_PLLBCK_Val << PMC_CPU_CKR_CPCSS_Pos) /* (PMC_CPU_CKR) PLLBCK is selected Position  */
#define PMC_CPU_CKR_CPCSS_PLLCCK              (PMC_CPU_CKR_CPCSS_PLLCCK_Val << PMC_CPU_CKR_CPCSS_Pos) /* (PMC_CPU_CKR) PLLCCK is selected Position  */
#define PMC_CPU_CKR_CPPRES_Pos                _UINT32_(20)                                         /* (PMC_CPU_CKR) Coprocessor MCK1 Prescaler Position */
#define PMC_CPU_CKR_CPPRES_Msk                (_UINT32_(0xF) << PMC_CPU_CKR_CPPRES_Pos)            /* (PMC_CPU_CKR) Coprocessor MCK1 Prescaler Mask */
#define PMC_CPU_CKR_CPPRES(value)             (PMC_CPU_CKR_CPPRES_Msk & (_UINT32_(value) << PMC_CPU_CKR_CPPRES_Pos)) /* Assigment of value for CPPRES in the PMC_CPU_CKR register */
#define   PMC_CPU_CKR_CPPRES_CLK_1_Val        _UINT32_(0x0)                                        /* (PMC_CPU_CKR) Selected clock  */
#define   PMC_CPU_CKR_CPPRES_CLK_2_Val        _UINT32_(0x1)                                        /* (PMC_CPU_CKR) Selected clock divided by 2  */
#define   PMC_CPU_CKR_CPPRES_CLK_3_Val        _UINT32_(0x2)                                        /* (PMC_CPU_CKR) Selected clock divided by 3  */
#define   PMC_CPU_CKR_CPPRES_CLK_4_Val        _UINT32_(0x3)                                        /* (PMC_CPU_CKR) Selected clock divided by 4  */
#define   PMC_CPU_CKR_CPPRES_CLK_5_Val        _UINT32_(0x4)                                        /* (PMC_CPU_CKR) Selected clock divided by 5  */
#define   PMC_CPU_CKR_CPPRES_CLK_6_Val        _UINT32_(0x5)                                        /* (PMC_CPU_CKR) Selected clock divided by 6  */
#define   PMC_CPU_CKR_CPPRES_CLK_7_Val        _UINT32_(0x6)                                        /* (PMC_CPU_CKR) Selected clock divided by 7  */
#define   PMC_CPU_CKR_CPPRES_CLK_8_Val        _UINT32_(0x7)                                        /* (PMC_CPU_CKR) Selected clock divided by 8  */
#define   PMC_CPU_CKR_CPPRES_CLK_9_Val        _UINT32_(0x8)                                        /* (PMC_CPU_CKR) Selected clock divided by 9  */
#define   PMC_CPU_CKR_CPPRES_CLK_10_Val       _UINT32_(0x9)                                        /* (PMC_CPU_CKR) Selected clock divided by 10  */
#define   PMC_CPU_CKR_CPPRES_CLK_11_Val       _UINT32_(0xA)                                        /* (PMC_CPU_CKR) Selected clock divided by 11  */
#define   PMC_CPU_CKR_CPPRES_CLK_12_Val       _UINT32_(0xB)                                        /* (PMC_CPU_CKR) Selected clock divided by 12  */
#define   PMC_CPU_CKR_CPPRES_CLK_13_Val       _UINT32_(0xC)                                        /* (PMC_CPU_CKR) Selected clock divided by 13  */
#define   PMC_CPU_CKR_CPPRES_CLK_14_Val       _UINT32_(0xD)                                        /* (PMC_CPU_CKR) Selected clock divided by 14  */
#define   PMC_CPU_CKR_CPPRES_CLK_15_Val       _UINT32_(0xE)                                        /* (PMC_CPU_CKR) Selected clock divided by 15  */
#define   PMC_CPU_CKR_CPPRES_CLK_16_Val       _UINT32_(0xF)                                        /* (PMC_CPU_CKR) Selected clock divided by 16  */
#define PMC_CPU_CKR_CPPRES_CLK_1              (PMC_CPU_CKR_CPPRES_CLK_1_Val << PMC_CPU_CKR_CPPRES_Pos) /* (PMC_CPU_CKR) Selected clock Position  */
#define PMC_CPU_CKR_CPPRES_CLK_2              (PMC_CPU_CKR_CPPRES_CLK_2_Val << PMC_CPU_CKR_CPPRES_Pos) /* (PMC_CPU_CKR) Selected clock divided by 2 Position  */
#define PMC_CPU_CKR_CPPRES_CLK_3              (PMC_CPU_CKR_CPPRES_CLK_3_Val << PMC_CPU_CKR_CPPRES_Pos) /* (PMC_CPU_CKR) Selected clock divided by 3 Position  */
#define PMC_CPU_CKR_CPPRES_CLK_4              (PMC_CPU_CKR_CPPRES_CLK_4_Val << PMC_CPU_CKR_CPPRES_Pos) /* (PMC_CPU_CKR) Selected clock divided by 4 Position  */
#define PMC_CPU_CKR_CPPRES_CLK_5              (PMC_CPU_CKR_CPPRES_CLK_5_Val << PMC_CPU_CKR_CPPRES_Pos) /* (PMC_CPU_CKR) Selected clock divided by 5 Position  */
#define PMC_CPU_CKR_CPPRES_CLK_6              (PMC_CPU_CKR_CPPRES_CLK_6_Val << PMC_CPU_CKR_CPPRES_Pos) /* (PMC_CPU_CKR) Selected clock divided by 6 Position  */
#define PMC_CPU_CKR_CPPRES_CLK_7              (PMC_CPU_CKR_CPPRES_CLK_7_Val << PMC_CPU_CKR_CPPRES_Pos) /* (PMC_CPU_CKR) Selected clock divided by 7 Position  */
#define PMC_CPU_CKR_CPPRES_CLK_8              (PMC_CPU_CKR_CPPRES_CLK_8_Val << PMC_CPU_CKR_CPPRES_Pos) /* (PMC_CPU_CKR) Selected clock divided by 8 Position  */
#define PMC_CPU_CKR_CPPRES_CLK_9              (PMC_CPU_CKR_CPPRES_CLK_9_Val << PMC_CPU_CKR_CPPRES_Pos) /* (PMC_CPU_CKR) Selected clock divided by 9 Position  */
#define PMC_CPU_CKR_CPPRES_CLK_10             (PMC_CPU_CKR_CPPRES_CLK_10_Val << PMC_CPU_CKR_CPPRES_Pos) /* (PMC_CPU_CKR) Selected clock divided by 10 Position  */
#define PMC_CPU_CKR_CPPRES_CLK_11             (PMC_CPU_CKR_CPPRES_CLK_11_Val << PMC_CPU_CKR_CPPRES_Pos) /* (PMC_CPU_CKR) Selected clock divided by 11 Position  */
#define PMC_CPU_CKR_CPPRES_CLK_12             (PMC_CPU_CKR_CPPRES_CLK_12_Val << PMC_CPU_CKR_CPPRES_Pos) /* (PMC_CPU_CKR) Selected clock divided by 12 Position  */
#define PMC_CPU_CKR_CPPRES_CLK_13             (PMC_CPU_CKR_CPPRES_CLK_13_Val << PMC_CPU_CKR_CPPRES_Pos) /* (PMC_CPU_CKR) Selected clock divided by 13 Position  */
#define PMC_CPU_CKR_CPPRES_CLK_14             (PMC_CPU_CKR_CPPRES_CLK_14_Val << PMC_CPU_CKR_CPPRES_Pos) /* (PMC_CPU_CKR) Selected clock divided by 14 Position  */
#define PMC_CPU_CKR_CPPRES_CLK_15             (PMC_CPU_CKR_CPPRES_CLK_15_Val << PMC_CPU_CKR_CPPRES_Pos) /* (PMC_CPU_CKR) Selected clock divided by 15 Position  */
#define PMC_CPU_CKR_CPPRES_CLK_16             (PMC_CPU_CKR_CPPRES_CLK_16_Val << PMC_CPU_CKR_CPPRES_Pos) /* (PMC_CPU_CKR) Selected clock divided by 16 Position  */
#define PMC_CPU_CKR_RATIO_MCK0DIV_Pos         _UINT32_(24)                                         /* (PMC_CPU_CKR) MCK0 Clock Frequency Division for MCK0DIV Clock Position */
#define PMC_CPU_CKR_RATIO_MCK0DIV_Msk         (_UINT32_(0x1) << PMC_CPU_CKR_RATIO_MCK0DIV_Pos)     /* (PMC_CPU_CKR) MCK0 Clock Frequency Division for MCK0DIV Clock Mask */
#define PMC_CPU_CKR_RATIO_MCK0DIV(value)      (PMC_CPU_CKR_RATIO_MCK0DIV_Msk & (_UINT32_(value) << PMC_CPU_CKR_RATIO_MCK0DIV_Pos)) /* Assigment of value for RATIO_MCK0DIV in the PMC_CPU_CKR register */
#define PMC_CPU_CKR_RATIO_MCK1DIV_Pos         _UINT32_(25)                                         /* (PMC_CPU_CKR) MCK1 Clock Frequency Division for MCK1DIV Clock Position */
#define PMC_CPU_CKR_RATIO_MCK1DIV_Msk         (_UINT32_(0x1) << PMC_CPU_CKR_RATIO_MCK1DIV_Pos)     /* (PMC_CPU_CKR) MCK1 Clock Frequency Division for MCK1DIV Clock Mask */
#define PMC_CPU_CKR_RATIO_MCK1DIV(value)      (PMC_CPU_CKR_RATIO_MCK1DIV_Msk & (_UINT32_(value) << PMC_CPU_CKR_RATIO_MCK1DIV_Pos)) /* Assigment of value for RATIO_MCK1DIV in the PMC_CPU_CKR register */
#define PMC_CPU_CKR_RATIO_MCK0DIV2_Pos        _UINT32_(26)                                         /* (PMC_CPU_CKR) MCK0 Clock Frequency Division for MCK0DIV2 Clock Position */
#define PMC_CPU_CKR_RATIO_MCK0DIV2_Msk        (_UINT32_(0x1) << PMC_CPU_CKR_RATIO_MCK0DIV2_Pos)    /* (PMC_CPU_CKR) MCK0 Clock Frequency Division for MCK0DIV2 Clock Mask */
#define PMC_CPU_CKR_RATIO_MCK0DIV2(value)     (PMC_CPU_CKR_RATIO_MCK0DIV2_Msk & (_UINT32_(value) << PMC_CPU_CKR_RATIO_MCK0DIV2_Pos)) /* Assigment of value for RATIO_MCK0DIV2 in the PMC_CPU_CKR register */
#define PMC_CPU_CKR_Msk                       _UINT32_(0x07F70073)                                 /* (PMC_CPU_CKR) Register Mask  */


/* -------- PMC_PCK : (PMC Offset: 0x44) (R/W 32) Programmable Clock Register (chid = 0) -------- */
#define PMC_PCK_CSS_Pos                       _UINT32_(0)                                          /* (PMC_PCK) Programmable Clock Source Selection Position */
#define PMC_PCK_CSS_Msk                       (_UINT32_(0x1F) << PMC_PCK_CSS_Pos)                  /* (PMC_PCK) Programmable Clock Source Selection Mask */
#define PMC_PCK_CSS(value)                    (PMC_PCK_CSS_Msk & (_UINT32_(value) << PMC_PCK_CSS_Pos)) /* Assigment of value for CSS in the PMC_PCK register */
#define   PMC_PCK_CSS_MD_SLOW_CLK_Val         _UINT32_(0x0)                                        /* (PMC_PCK) MD_SLCK is selected  */
#define   PMC_PCK_CSS_TD_SLOW_CLOCK_Val       _UINT32_(0x1)                                        /* (PMC_PCK) TD_SLCK is selected  */
#define   PMC_PCK_CSS_MAINCK_Val              _UINT32_(0x2)                                        /* (PMC_PCK) MAINCK is selected  */
#define   PMC_PCK_CSS_MCK0_Val                _UINT32_(0x3)                                        /* (PMC_PCK) MCK0 is selected  */
#define   PMC_PCK_CSS_PLLACK1_Val             _UINT32_(0x4)                                        /* (PMC_PCK) PLLACK1 is selected.  */
#define   PMC_PCK_CSS_PLLBCK_Val              _UINT32_(0x5)                                        /* (PMC_PCK) PLLBCK is selected.  */
#define   PMC_PCK_CSS_PLLCCK_Val              _UINT32_(0x6)                                        /* (PMC_PCK) PLLCCK is selected.  */
#define   PMC_PCK_CSS_PLLCSRC_Val             _UINT32_(0x7)                                        /* (PMC_PCK) PLLCSRC is selected.  */
#define PMC_PCK_CSS_MD_SLOW_CLK               (PMC_PCK_CSS_MD_SLOW_CLK_Val << PMC_PCK_CSS_Pos)     /* (PMC_PCK) MD_SLCK is selected Position  */
#define PMC_PCK_CSS_TD_SLOW_CLOCK             (PMC_PCK_CSS_TD_SLOW_CLOCK_Val << PMC_PCK_CSS_Pos)   /* (PMC_PCK) TD_SLCK is selected Position  */
#define PMC_PCK_CSS_MAINCK                    (PMC_PCK_CSS_MAINCK_Val << PMC_PCK_CSS_Pos)          /* (PMC_PCK) MAINCK is selected Position  */
#define PMC_PCK_CSS_MCK0                      (PMC_PCK_CSS_MCK0_Val << PMC_PCK_CSS_Pos)            /* (PMC_PCK) MCK0 is selected Position  */
#define PMC_PCK_CSS_PLLACK1                   (PMC_PCK_CSS_PLLACK1_Val << PMC_PCK_CSS_Pos)         /* (PMC_PCK) PLLACK1 is selected. Position  */
#define PMC_PCK_CSS_PLLBCK                    (PMC_PCK_CSS_PLLBCK_Val << PMC_PCK_CSS_Pos)          /* (PMC_PCK) PLLBCK is selected. Position  */
#define PMC_PCK_CSS_PLLCCK                    (PMC_PCK_CSS_PLLCCK_Val << PMC_PCK_CSS_Pos)          /* (PMC_PCK) PLLCCK is selected. Position  */
#define PMC_PCK_CSS_PLLCSRC                   (PMC_PCK_CSS_PLLCSRC_Val << PMC_PCK_CSS_Pos)         /* (PMC_PCK) PLLCSRC is selected. Position  */
#define PMC_PCK_PRES_Pos                      _UINT32_(8)                                          /* (PMC_PCK) Programmable Clock Prescaler Position */
#define PMC_PCK_PRES_Msk                      (_UINT32_(0xFF) << PMC_PCK_PRES_Pos)                 /* (PMC_PCK) Programmable Clock Prescaler Mask */
#define PMC_PCK_PRES(value)                   (PMC_PCK_PRES_Msk & (_UINT32_(value) << PMC_PCK_PRES_Pos)) /* Assigment of value for PRES in the PMC_PCK register */
#define PMC_PCK_Msk                           _UINT32_(0x0000FF1F)                                 /* (PMC_PCK) Register Mask  */


