Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/bootloader/pic32cx_mtsh_db/src/packs/PIC32CX2051MTSH128_DFP/component/pmc.h
#define PMC_CSR1_PID_Pos                      _UINT32_(0)                                          /* (PMC_CSR1 Position) Peripheral Clock 59 Status */
#define PMC_CSR1_PID_Msk                      (_UINT32_(0x3FFF) << PMC_CSR1_PID_Pos)               /* (PMC_CSR1 Mask) PID */
#define PMC_CSR1_PID(value)                   (PMC_CSR1_PID_Msk & (_UINT32_(value) << PMC_CSR1_PID_Pos)) 

/* -------- PMC_CSR2 : (PMC Offset: 0xAC) ( R/ 32) Peripheral Clock Status Register 2 -------- */
#define PMC_CSR2_PID75_Pos                    _UINT32_(11)                                         /* (PMC_CSR2) Peripheral Clock 75 Status Position */
#define PMC_CSR2_PID75_Msk                    (_UINT32_(0x1) << PMC_CSR2_PID75_Pos)                /* (PMC_CSR2) Peripheral Clock 75 Status Mask */
#define PMC_CSR2_PID75(value)                 (PMC_CSR2_PID75_Msk & (_UINT32_(value) << PMC_CSR2_PID75_Pos)) /* Assigment of value for PID75 in the PMC_CSR2 register */
#define PMC_CSR2_PID78_Pos                    _UINT32_(14)                                         /* (PMC_CSR2) Peripheral Clock 78 Status Position */
#define PMC_CSR2_PID78_Msk                    (_UINT32_(0x1) << PMC_CSR2_PID78_Pos)                /* (PMC_CSR2) Peripheral Clock 78 Status Mask */
#define PMC_CSR2_PID78(value)                 (PMC_CSR2_PID78_Msk & (_UINT32_(value) << PMC_CSR2_PID78_Pos)) /* Assigment of value for PID78 in the PMC_CSR2 register */
#define PMC_CSR2_PID79_Pos                    _UINT32_(15)                                         /* (PMC_CSR2) Peripheral Clock 79 Status Position */
#define PMC_CSR2_PID79_Msk                    (_UINT32_(0x1) << PMC_CSR2_PID79_Pos)                /* (PMC_CSR2) Peripheral Clock 79 Status Mask */
#define PMC_CSR2_PID79(value)                 (PMC_CSR2_PID79_Msk & (_UINT32_(value) << PMC_CSR2_PID79_Pos)) /* Assigment of value for PID79 in the PMC_CSR2 register */
#define PMC_CSR2_PID80_Pos                    _UINT32_(16)                                         /* (PMC_CSR2) Peripheral Clock 80 Status Position */
#define PMC_CSR2_PID80_Msk                    (_UINT32_(0x1) << PMC_CSR2_PID80_Pos)                /* (PMC_CSR2) Peripheral Clock 80 Status Mask */
#define PMC_CSR2_PID80(value)                 (PMC_CSR2_PID80_Msk & (_UINT32_(value) << PMC_CSR2_PID80_Pos)) /* Assigment of value for PID80 in the PMC_CSR2 register */
#define PMC_CSR2_PID81_Pos                    _UINT32_(17)                                         /* (PMC_CSR2) Peripheral Clock 81 Status Position */
#define PMC_CSR2_PID81_Msk                    (_UINT32_(0x1) << PMC_CSR2_PID81_Pos)                /* (PMC_CSR2) Peripheral Clock 81 Status Mask */
#define PMC_CSR2_PID81(value)                 (PMC_CSR2_PID81_Msk & (_UINT32_(value) << PMC_CSR2_PID81_Pos)) /* Assigment of value for PID81 in the PMC_CSR2 register */
#define PMC_CSR2_PID85_Pos                    _UINT32_(21)                                         /* (PMC_CSR2) Peripheral Clock 85 Status Position */
#define PMC_CSR2_PID85_Msk                    (_UINT32_(0x1) << PMC_CSR2_PID85_Pos)                /* (PMC_CSR2) Peripheral Clock 85 Status Mask */
#define PMC_CSR2_PID85(value)                 (PMC_CSR2_PID85_Msk & (_UINT32_(value) << PMC_CSR2_PID85_Pos)) /* Assigment of value for PID85 in the PMC_CSR2 register */
#define PMC_CSR2_PID87_Pos                    _UINT32_(23)                                         /* (PMC_CSR2) Peripheral Clock 87 Status Position */
#define PMC_CSR2_PID87_Msk                    (_UINT32_(0x1) << PMC_CSR2_PID87_Pos)                /* (PMC_CSR2) Peripheral Clock 87 Status Mask */
#define PMC_CSR2_PID87(value)                 (PMC_CSR2_PID87_Msk & (_UINT32_(value) << PMC_CSR2_PID87_Pos)) /* Assigment of value for PID87 in the PMC_CSR2 register */
#define PMC_CSR2_PID88_Pos                    _UINT32_(24)                                         /* (PMC_CSR2) Peripheral Clock 88 Status Position */
#define PMC_CSR2_PID88_Msk                    (_UINT32_(0x1) << PMC_CSR2_PID88_Pos)                /* (PMC_CSR2) Peripheral Clock 88 Status Mask */
#define PMC_CSR2_PID88(value)                 (PMC_CSR2_PID88_Msk & (_UINT32_(value) << PMC_CSR2_PID88_Pos)) /* Assigment of value for PID88 in the PMC_CSR2 register */
#define PMC_CSR2_PID89_Pos                    _UINT32_(25)                                         /* (PMC_CSR2) Peripheral Clock 89 Status Position */
#define PMC_CSR2_PID89_Msk                    (_UINT32_(0x1) << PMC_CSR2_PID89_Pos)                /* (PMC_CSR2) Peripheral Clock 89 Status Mask */
#define PMC_CSR2_PID89(value)                 (PMC_CSR2_PID89_Msk & (_UINT32_(value) << PMC_CSR2_PID89_Pos)) /* Assigment of value for PID89 in the PMC_CSR2 register */
#define PMC_CSR2_PID90_Pos                    _UINT32_(26)                                         /* (PMC_CSR2) Peripheral Clock 90 Status Position */
#define PMC_CSR2_PID90_Msk                    (_UINT32_(0x1) << PMC_CSR2_PID90_Pos)                /* (PMC_CSR2) Peripheral Clock 90 Status Mask */
#define PMC_CSR2_PID90(value)                 (PMC_CSR2_PID90_Msk & (_UINT32_(value) << PMC_CSR2_PID90_Pos)) /* Assigment of value for PID90 in the PMC_CSR2 register */
#define PMC_CSR2_PID91_Pos                    _UINT32_(27)                                         /* (PMC_CSR2) Peripheral Clock 91 Status Position */
#define PMC_CSR2_PID91_Msk                    (_UINT32_(0x1) << PMC_CSR2_PID91_Pos)                /* (PMC_CSR2) Peripheral Clock 91 Status Mask */
#define PMC_CSR2_PID91(value)                 (PMC_CSR2_PID91_Msk & (_UINT32_(value) << PMC_CSR2_PID91_Pos)) /* Assigment of value for PID91 in the PMC_CSR2 register */
#define PMC_CSR2_Msk                          _UINT32_(0x0FA3C800)                                 /* (PMC_CSR2) Register Mask  */

#define PMC_CSR2_PID_Pos                      _UINT32_(11)                                         /* (PMC_CSR2 Position) Peripheral Clock 9x Status */
#define PMC_CSR2_PID_Msk                      (_UINT32_(0x7FF) << PMC_CSR2_PID_Pos)                /* (PMC_CSR2 Mask) PID */
#define PMC_CSR2_PID(value)                   (PMC_CSR2_PID_Msk & (_UINT32_(value) << PMC_CSR2_PID_Pos)) 

/* -------- PMC_CSR3 : (PMC Offset: 0xB0) ( R/ 32) Peripheral Clock Status Register 3 -------- */
#define PMC_CSR3_PID96_Pos                    _UINT32_(0)                                          /* (PMC_CSR3) Peripheral Clock 96 Status Position */
#define PMC_CSR3_PID96_Msk                    (_UINT32_(0x1) << PMC_CSR3_PID96_Pos)                /* (PMC_CSR3) Peripheral Clock 96 Status Mask */
#define PMC_CSR3_PID96(value)                 (PMC_CSR3_PID96_Msk & (_UINT32_(value) << PMC_CSR3_PID96_Pos)) /* Assigment of value for PID96 in the PMC_CSR3 register */
#define PMC_CSR3_Msk                          _UINT32_(0x00000001)                                 /* (PMC_CSR3) Register Mask  */

