Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/bootloader/pic32cx_mtsh_db/src/packs/PIC32CX2051MTSH128_DFP/component/pmc.h
#define PMC_GCSR1_GPID_Pos                    _UINT32_(2)                                          /* (PMC_GCSR1 Position) Generic Clock 37 Status */
#define PMC_GCSR1_GPID_Msk                    (_UINT32_(0x3) << PMC_GCSR1_GPID_Pos)                /* (PMC_GCSR1 Mask) GPID */
#define PMC_GCSR1_GPID(value)                 (PMC_GCSR1_GPID_Msk & (_UINT32_(value) << PMC_GCSR1_GPID_Pos)) 

/* -------- PMC_GCSR2 : (PMC Offset: 0xCC) ( R/ 32) Generic Clock Status Register 2 -------- */
#define PMC_GCSR2_GPID75_Pos                  _UINT32_(11)                                         /* (PMC_GCSR2) Generic Clock 75 Status Position */
#define PMC_GCSR2_GPID75_Msk                  (_UINT32_(0x1) << PMC_GCSR2_GPID75_Pos)              /* (PMC_GCSR2) Generic Clock 75 Status Mask */
#define PMC_GCSR2_GPID75(value)               (PMC_GCSR2_GPID75_Msk & (_UINT32_(value) << PMC_GCSR2_GPID75_Pos)) /* Assigment of value for GPID75 in the PMC_GCSR2 register */
#define PMC_GCSR2_GPID79_Pos                  _UINT32_(15)                                         /* (PMC_GCSR2) Generic Clock 79 Status Position */
#define PMC_GCSR2_GPID79_Msk                  (_UINT32_(0x1) << PMC_GCSR2_GPID79_Pos)              /* (PMC_GCSR2) Generic Clock 79 Status Mask */
#define PMC_GCSR2_GPID79(value)               (PMC_GCSR2_GPID79_Msk & (_UINT32_(value) << PMC_GCSR2_GPID79_Pos)) /* Assigment of value for GPID79 in the PMC_GCSR2 register */
#define PMC_GCSR2_GPID87_Pos                  _UINT32_(23)                                         /* (PMC_GCSR2) Generic Clock 87 Status Position */
#define PMC_GCSR2_GPID87_Msk                  (_UINT32_(0x1) << PMC_GCSR2_GPID87_Pos)              /* (PMC_GCSR2) Generic Clock 87 Status Mask */
#define PMC_GCSR2_GPID87(value)               (PMC_GCSR2_GPID87_Msk & (_UINT32_(value) << PMC_GCSR2_GPID87_Pos)) /* Assigment of value for GPID87 in the PMC_GCSR2 register */
#define PMC_GCSR2_GPID89_Pos                  _UINT32_(25)                                         /* (PMC_GCSR2) Generic Clock 89 Status Position */
#define PMC_GCSR2_GPID89_Msk                  (_UINT32_(0x1) << PMC_GCSR2_GPID89_Pos)              /* (PMC_GCSR2) Generic Clock 89 Status Mask */
#define PMC_GCSR2_GPID89(value)               (PMC_GCSR2_GPID89_Msk & (_UINT32_(value) << PMC_GCSR2_GPID89_Pos)) /* Assigment of value for GPID89 in the PMC_GCSR2 register */
#define PMC_GCSR2_GPID90_Pos                  _UINT32_(26)                                         /* (PMC_GCSR2) Generic Clock 90 Status Position */
#define PMC_GCSR2_GPID90_Msk                  (_UINT32_(0x1) << PMC_GCSR2_GPID90_Pos)              /* (PMC_GCSR2) Generic Clock 90 Status Mask */
#define PMC_GCSR2_GPID90(value)               (PMC_GCSR2_GPID90_Msk & (_UINT32_(value) << PMC_GCSR2_GPID90_Pos)) /* Assigment of value for GPID90 in the PMC_GCSR2 register */
#define PMC_GCSR2_Msk                         _UINT32_(0x06808800)                                 /* (PMC_GCSR2) Register Mask  */

#define PMC_GCSR2_GPID_Pos                    _UINT32_(11)                                         /* (PMC_GCSR2 Position) Generic Clock 9x Status */
#define PMC_GCSR2_GPID_Msk                    (_UINT32_(0x1F) << PMC_GCSR2_GPID_Pos)               /* (PMC_GCSR2 Mask) GPID */
#define PMC_GCSR2_GPID(value)                 (PMC_GCSR2_GPID_Msk & (_UINT32_(value) << PMC_GCSR2_GPID_Pos)) 

/* -------- PMC_GCSR3 : (PMC Offset: 0xD0) ( R/ 32) Generic Clock Status Register 3 -------- */
#define PMC_GCSR3_GPID96_Pos                  _UINT32_(0)                                          /* (PMC_GCSR3) Generic Clock 96 Status Position */
#define PMC_GCSR3_GPID96_Msk                  (_UINT32_(0x1) << PMC_GCSR3_GPID96_Pos)              /* (PMC_GCSR3) Generic Clock 96 Status Mask */
#define PMC_GCSR3_GPID96(value)               (PMC_GCSR3_GPID96_Msk & (_UINT32_(value) << PMC_GCSR3_GPID96_Pos)) /* Assigment of value for GPID96 in the PMC_GCSR3 register */
#define PMC_GCSR3_Msk                         _UINT32_(0x00000001)                                 /* (PMC_GCSR3) Register Mask  */

#define PMC_GCSR3_GPID_Pos                    _UINT32_(0)                                          /* (PMC_GCSR3 Position) Generic Clock 96 Status */
#define PMC_GCSR3_GPID_Msk                    (_UINT32_(0x1) << PMC_GCSR3_GPID_Pos)                /* (PMC_GCSR3 Mask) GPID */
#define PMC_GCSR3_GPID(value)                 (PMC_GCSR3_GPID_Msk & (_UINT32_(value) << PMC_GCSR3_GPID_Pos)) 

/* -------- PMC_PLL_IER : (PMC Offset: 0xE4) ( /W 32) PLL Interrupt Enable Register -------- */
#define PMC_PLL_IER_LOCK0_Pos                 _UINT32_(0)                                          /* (PMC_PLL_IER) PLL of Index 0 Lock Interrupt Enable Position */
#define PMC_PLL_IER_LOCK0_Msk                 (_UINT32_(0x1) << PMC_PLL_IER_LOCK0_Pos)             /* (PMC_PLL_IER) PLL of Index 0 Lock Interrupt Enable Mask */
#define PMC_PLL_IER_LOCK0(value)              (PMC_PLL_IER_LOCK0_Msk & (_UINT32_(value) << PMC_PLL_IER_LOCK0_Pos)) /* Assigment of value for LOCK0 in the PMC_PLL_IER register */
#define PMC_PLL_IER_LOCK1_Pos                 _UINT32_(1)                                          /* (PMC_PLL_IER) PLL of Index 1 Lock Interrupt Enable Position */
#define PMC_PLL_IER_LOCK1_Msk                 (_UINT32_(0x1) << PMC_PLL_IER_LOCK1_Pos)             /* (PMC_PLL_IER) PLL of Index 1 Lock Interrupt Enable Mask */
#define PMC_PLL_IER_LOCK1(value)              (PMC_PLL_IER_LOCK1_Msk & (_UINT32_(value) << PMC_PLL_IER_LOCK1_Pos)) /* Assigment of value for LOCK1 in the PMC_PLL_IER register */
#define PMC_PLL_IER_LOCK2_Pos                 _UINT32_(2)                                          /* (PMC_PLL_IER) PLL of Index 2 Lock Interrupt Enable Position */
#define PMC_PLL_IER_LOCK2_Msk                 (_UINT32_(0x1) << PMC_PLL_IER_LOCK2_Pos)             /* (PMC_PLL_IER) PLL of Index 2 Lock Interrupt Enable Mask */
#define PMC_PLL_IER_LOCK2(value)              (PMC_PLL_IER_LOCK2_Msk & (_UINT32_(value) << PMC_PLL_IER_LOCK2_Pos)) /* Assigment of value for LOCK2 in the PMC_PLL_IER register */
#define PMC_PLL_IER_UNLOCK0_Pos               _UINT32_(16)                                         /* (PMC_PLL_IER) PLL of Index 0 Unlock Interrupt Enable Position */
#define PMC_PLL_IER_UNLOCK0_Msk               (_UINT32_(0x1) << PMC_PLL_IER_UNLOCK0_Pos)           /* (PMC_PLL_IER) PLL of Index 0 Unlock Interrupt Enable Mask */
#define PMC_PLL_IER_UNLOCK0(value)            (PMC_PLL_IER_UNLOCK0_Msk & (_UINT32_(value) << PMC_PLL_IER_UNLOCK0_Pos)) /* Assigment of value for UNLOCK0 in the PMC_PLL_IER register */
#define PMC_PLL_IER_UNLOCK1_Pos               _UINT32_(17)                                         /* (PMC_PLL_IER) PLL of Index 1 Unlock Interrupt Enable Position */
#define PMC_PLL_IER_UNLOCK1_Msk               (_UINT32_(0x1) << PMC_PLL_IER_UNLOCK1_Pos)           /* (PMC_PLL_IER) PLL of Index 1 Unlock Interrupt Enable Mask */
#define PMC_PLL_IER_UNLOCK1(value)            (PMC_PLL_IER_UNLOCK1_Msk & (_UINT32_(value) << PMC_PLL_IER_UNLOCK1_Pos)) /* Assigment of value for UNLOCK1 in the PMC_PLL_IER register */
#define PMC_PLL_IER_UNLOCK2_Pos               _UINT32_(18)                                         /* (PMC_PLL_IER) PLL of Index 2 Unlock Interrupt Enable Position */
#define PMC_PLL_IER_UNLOCK2_Msk               (_UINT32_(0x1) << PMC_PLL_IER_UNLOCK2_Pos)           /* (PMC_PLL_IER) PLL of Index 2 Unlock Interrupt Enable Mask */
#define PMC_PLL_IER_UNLOCK2(value)            (PMC_PLL_IER_UNLOCK2_Msk & (_UINT32_(value) << PMC_PLL_IER_UNLOCK2_Pos)) /* Assigment of value for UNLOCK2 in the PMC_PLL_IER register */
#define PMC_PLL_IER_Msk                       _UINT32_(0x00070007)                                 /* (PMC_PLL_IER) Register Mask  */

