Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/bootloader/pic32cx_mtsh_db/src/packs/PIC32CX2051MTSH128_DFP/component/pmc.h
#define PMC_PLL_IER_LOCK_Pos                  _UINT32_(0)                                          /* (PMC_PLL_IER Position) PLL of Index x Lock Interrupt Enable */
#define PMC_PLL_IER_LOCK_Msk                  (_UINT32_(0x7) << PMC_PLL_IER_LOCK_Pos)              /* (PMC_PLL_IER Mask) LOCK */
#define PMC_PLL_IER_LOCK(value)               (PMC_PLL_IER_LOCK_Msk & (_UINT32_(value) << PMC_PLL_IER_LOCK_Pos)) 
#define PMC_PLL_IER_UNLOCK_Pos                _UINT32_(16)                                         /* (PMC_PLL_IER Position) PLL of Index 2 Unlock Interrupt Enable */
#define PMC_PLL_IER_UNLOCK_Msk                (_UINT32_(0x7) << PMC_PLL_IER_UNLOCK_Pos)            /* (PMC_PLL_IER Mask) UNLOCK */
#define PMC_PLL_IER_UNLOCK(value)             (PMC_PLL_IER_UNLOCK_Msk & (_UINT32_(value) << PMC_PLL_IER_UNLOCK_Pos)) 

/* -------- PMC_PLL_IDR : (PMC Offset: 0xE8) ( /W 32) PLL Interrupt Disable Register -------- */
#define PMC_PLL_IDR_LOCK0_Pos                 _UINT32_(0)                                          /* (PMC_PLL_IDR) PLL of Index 0 Lock Interrupt Disable Position */
#define PMC_PLL_IDR_LOCK0_Msk                 (_UINT32_(0x1) << PMC_PLL_IDR_LOCK0_Pos)             /* (PMC_PLL_IDR) PLL of Index 0 Lock Interrupt Disable Mask */
#define PMC_PLL_IDR_LOCK0(value)              (PMC_PLL_IDR_LOCK0_Msk & (_UINT32_(value) << PMC_PLL_IDR_LOCK0_Pos)) /* Assigment of value for LOCK0 in the PMC_PLL_IDR register */
#define PMC_PLL_IDR_LOCK1_Pos                 _UINT32_(1)                                          /* (PMC_PLL_IDR) PLL of Index 1 Lock Interrupt Disable Position */
#define PMC_PLL_IDR_LOCK1_Msk                 (_UINT32_(0x1) << PMC_PLL_IDR_LOCK1_Pos)             /* (PMC_PLL_IDR) PLL of Index 1 Lock Interrupt Disable Mask */
#define PMC_PLL_IDR_LOCK1(value)              (PMC_PLL_IDR_LOCK1_Msk & (_UINT32_(value) << PMC_PLL_IDR_LOCK1_Pos)) /* Assigment of value for LOCK1 in the PMC_PLL_IDR register */
#define PMC_PLL_IDR_LOCK2_Pos                 _UINT32_(2)                                          /* (PMC_PLL_IDR) PLL of Index 2 Lock Interrupt Disable Position */
#define PMC_PLL_IDR_LOCK2_Msk                 (_UINT32_(0x1) << PMC_PLL_IDR_LOCK2_Pos)             /* (PMC_PLL_IDR) PLL of Index 2 Lock Interrupt Disable Mask */
#define PMC_PLL_IDR_LOCK2(value)              (PMC_PLL_IDR_LOCK2_Msk & (_UINT32_(value) << PMC_PLL_IDR_LOCK2_Pos)) /* Assigment of value for LOCK2 in the PMC_PLL_IDR register */
#define PMC_PLL_IDR_UNLOCK0_Pos               _UINT32_(16)                                         /* (PMC_PLL_IDR) PLL of Index 0 Unlock Interrupt Disable Position */
#define PMC_PLL_IDR_UNLOCK0_Msk               (_UINT32_(0x1) << PMC_PLL_IDR_UNLOCK0_Pos)           /* (PMC_PLL_IDR) PLL of Index 0 Unlock Interrupt Disable Mask */
#define PMC_PLL_IDR_UNLOCK0(value)            (PMC_PLL_IDR_UNLOCK0_Msk & (_UINT32_(value) << PMC_PLL_IDR_UNLOCK0_Pos)) /* Assigment of value for UNLOCK0 in the PMC_PLL_IDR register */
#define PMC_PLL_IDR_UNLOCK1_Pos               _UINT32_(17)                                         /* (PMC_PLL_IDR) PLL of Index 1 Unlock Interrupt Disable Position */
#define PMC_PLL_IDR_UNLOCK1_Msk               (_UINT32_(0x1) << PMC_PLL_IDR_UNLOCK1_Pos)           /* (PMC_PLL_IDR) PLL of Index 1 Unlock Interrupt Disable Mask */
#define PMC_PLL_IDR_UNLOCK1(value)            (PMC_PLL_IDR_UNLOCK1_Msk & (_UINT32_(value) << PMC_PLL_IDR_UNLOCK1_Pos)) /* Assigment of value for UNLOCK1 in the PMC_PLL_IDR register */
#define PMC_PLL_IDR_UNLOCK2_Pos               _UINT32_(18)                                         /* (PMC_PLL_IDR) PLL of Index 2 Unlock Interrupt Disable Position */
#define PMC_PLL_IDR_UNLOCK2_Msk               (_UINT32_(0x1) << PMC_PLL_IDR_UNLOCK2_Pos)           /* (PMC_PLL_IDR) PLL of Index 2 Unlock Interrupt Disable Mask */
#define PMC_PLL_IDR_UNLOCK2(value)            (PMC_PLL_IDR_UNLOCK2_Msk & (_UINT32_(value) << PMC_PLL_IDR_UNLOCK2_Pos)) /* Assigment of value for UNLOCK2 in the PMC_PLL_IDR register */
#define PMC_PLL_IDR_Msk                       _UINT32_(0x00070007)                                 /* (PMC_PLL_IDR) Register Mask  */

#define PMC_PLL_IDR_LOCK_Pos                  _UINT32_(0)                                          /* (PMC_PLL_IDR Position) PLL of Index x Lock Interrupt Disable */
#define PMC_PLL_IDR_LOCK_Msk                  (_UINT32_(0x7) << PMC_PLL_IDR_LOCK_Pos)              /* (PMC_PLL_IDR Mask) LOCK */
#define PMC_PLL_IDR_LOCK(value)               (PMC_PLL_IDR_LOCK_Msk & (_UINT32_(value) << PMC_PLL_IDR_LOCK_Pos)) 
#define PMC_PLL_IDR_UNLOCK_Pos                _UINT32_(16)                                         /* (PMC_PLL_IDR Position) PLL of Index 2 Unlock Interrupt Disable */
#define PMC_PLL_IDR_UNLOCK_Msk                (_UINT32_(0x7) << PMC_PLL_IDR_UNLOCK_Pos)            /* (PMC_PLL_IDR Mask) UNLOCK */
#define PMC_PLL_IDR_UNLOCK(value)             (PMC_PLL_IDR_UNLOCK_Msk & (_UINT32_(value) << PMC_PLL_IDR_UNLOCK_Pos)) 

/* -------- PMC_PLL_IMR : (PMC Offset: 0xEC) ( R/ 32) PLL Interrupt Mask Register -------- */
#define PMC_PLL_IMR_LOCK0_Pos                 _UINT32_(0)                                          /* (PMC_PLL_IMR) PLL of Index 0 Lock Interrupt Mask Position */
#define PMC_PLL_IMR_LOCK0_Msk                 (_UINT32_(0x1) << PMC_PLL_IMR_LOCK0_Pos)             /* (PMC_PLL_IMR) PLL of Index 0 Lock Interrupt Mask Mask */
#define PMC_PLL_IMR_LOCK0(value)              (PMC_PLL_IMR_LOCK0_Msk & (_UINT32_(value) << PMC_PLL_IMR_LOCK0_Pos)) /* Assigment of value for LOCK0 in the PMC_PLL_IMR register */
#define PMC_PLL_IMR_LOCK1_Pos                 _UINT32_(1)                                          /* (PMC_PLL_IMR) PLL of Index 1 Lock Interrupt Mask Position */
#define PMC_PLL_IMR_LOCK1_Msk                 (_UINT32_(0x1) << PMC_PLL_IMR_LOCK1_Pos)             /* (PMC_PLL_IMR) PLL of Index 1 Lock Interrupt Mask Mask */
#define PMC_PLL_IMR_LOCK1(value)              (PMC_PLL_IMR_LOCK1_Msk & (_UINT32_(value) << PMC_PLL_IMR_LOCK1_Pos)) /* Assigment of value for LOCK1 in the PMC_PLL_IMR register */
#define PMC_PLL_IMR_LOCK2_Pos                 _UINT32_(2)                                          /* (PMC_PLL_IMR) PLL of Index 2 Lock Interrupt Mask Position */
#define PMC_PLL_IMR_LOCK2_Msk                 (_UINT32_(0x1) << PMC_PLL_IMR_LOCK2_Pos)             /* (PMC_PLL_IMR) PLL of Index 2 Lock Interrupt Mask Mask */
#define PMC_PLL_IMR_LOCK2(value)              (PMC_PLL_IMR_LOCK2_Msk & (_UINT32_(value) << PMC_PLL_IMR_LOCK2_Pos)) /* Assigment of value for LOCK2 in the PMC_PLL_IMR register */
#define PMC_PLL_IMR_UNLOCK0_Pos               _UINT32_(16)                                         /* (PMC_PLL_IMR) PLL of Index 0 Unlock Interrupt Mask Position */
#define PMC_PLL_IMR_UNLOCK0_Msk               (_UINT32_(0x1) << PMC_PLL_IMR_UNLOCK0_Pos)           /* (PMC_PLL_IMR) PLL of Index 0 Unlock Interrupt Mask Mask */
#define PMC_PLL_IMR_UNLOCK0(value)            (PMC_PLL_IMR_UNLOCK0_Msk & (_UINT32_(value) << PMC_PLL_IMR_UNLOCK0_Pos)) /* Assigment of value for UNLOCK0 in the PMC_PLL_IMR register */
#define PMC_PLL_IMR_UNLOCK1_Pos               _UINT32_(17)                                         /* (PMC_PLL_IMR) PLL of Index 1 Unlock Interrupt Mask Position */
#define PMC_PLL_IMR_UNLOCK1_Msk               (_UINT32_(0x1) << PMC_PLL_IMR_UNLOCK1_Pos)           /* (PMC_PLL_IMR) PLL of Index 1 Unlock Interrupt Mask Mask */
#define PMC_PLL_IMR_UNLOCK1(value)            (PMC_PLL_IMR_UNLOCK1_Msk & (_UINT32_(value) << PMC_PLL_IMR_UNLOCK1_Pos)) /* Assigment of value for UNLOCK1 in the PMC_PLL_IMR register */
#define PMC_PLL_IMR_UNLOCK2_Pos               _UINT32_(18)                                         /* (PMC_PLL_IMR) PLL of Index 2 Unlock Interrupt Mask Position */
#define PMC_PLL_IMR_UNLOCK2_Msk               (_UINT32_(0x1) << PMC_PLL_IMR_UNLOCK2_Pos)           /* (PMC_PLL_IMR) PLL of Index 2 Unlock Interrupt Mask Mask */
#define PMC_PLL_IMR_UNLOCK2(value)            (PMC_PLL_IMR_UNLOCK2_Msk & (_UINT32_(value) << PMC_PLL_IMR_UNLOCK2_Pos)) /* Assigment of value for UNLOCK2 in the PMC_PLL_IMR register */
#define PMC_PLL_IMR_Msk                       _UINT32_(0x00070007)                                 /* (PMC_PLL_IMR) Register Mask  */

#define PMC_PLL_IMR_LOCK_Pos                  _UINT32_(0)                                          /* (PMC_PLL_IMR Position) PLL of Index x Lock Interrupt Mask */
#define PMC_PLL_IMR_LOCK_Msk                  (_UINT32_(0x7) << PMC_PLL_IMR_LOCK_Pos)              /* (PMC_PLL_IMR Mask) LOCK */
#define PMC_PLL_IMR_LOCK(value)               (PMC_PLL_IMR_LOCK_Msk & (_UINT32_(value) << PMC_PLL_IMR_LOCK_Pos)) 
#define PMC_PLL_IMR_UNLOCK_Pos                _UINT32_(16)                                         /* (PMC_PLL_IMR Position) PLL of Index 2 Unlock Interrupt Mask */
#define PMC_PLL_IMR_UNLOCK_Msk                (_UINT32_(0x7) << PMC_PLL_IMR_UNLOCK_Pos)            /* (PMC_PLL_IMR Mask) UNLOCK */
#define PMC_PLL_IMR_UNLOCK(value)             (PMC_PLL_IMR_UNLOCK_Msk & (_UINT32_(value) << PMC_PLL_IMR_UNLOCK_Pos)) 

/* -------- PMC_PLL_ISR0 : (PMC Offset: 0xF0) ( R/ 32) PLL Interrupt Status Register 0 -------- */
#define PMC_PLL_ISR0_LOCK0_Pos                _UINT32_(0)                                          /* (PMC_PLL_ISR0) PLL of Index 0 Lock Interrupt Status Position */
#define PMC_PLL_ISR0_LOCK0_Msk                (_UINT32_(0x1) << PMC_PLL_ISR0_LOCK0_Pos)            /* (PMC_PLL_ISR0) PLL of Index 0 Lock Interrupt Status Mask */
#define PMC_PLL_ISR0_LOCK0(value)             (PMC_PLL_ISR0_LOCK0_Msk & (_UINT32_(value) << PMC_PLL_ISR0_LOCK0_Pos)) /* Assigment of value for LOCK0 in the PMC_PLL_ISR0 register */
#define PMC_PLL_ISR0_LOCK1_Pos                _UINT32_(1)                                          /* (PMC_PLL_ISR0) PLL of Index 1 Lock Interrupt Status Position */
#define PMC_PLL_ISR0_LOCK1_Msk                (_UINT32_(0x1) << PMC_PLL_ISR0_LOCK1_Pos)            /* (PMC_PLL_ISR0) PLL of Index 1 Lock Interrupt Status Mask */
#define PMC_PLL_ISR0_LOCK1(value)             (PMC_PLL_ISR0_LOCK1_Msk & (_UINT32_(value) << PMC_PLL_ISR0_LOCK1_Pos)) /* Assigment of value for LOCK1 in the PMC_PLL_ISR0 register */
#define PMC_PLL_ISR0_LOCK2_Pos                _UINT32_(2)                                          /* (PMC_PLL_ISR0) PLL of Index 2 Lock Interrupt Status Position */
#define PMC_PLL_ISR0_LOCK2_Msk                (_UINT32_(0x1) << PMC_PLL_ISR0_LOCK2_Pos)            /* (PMC_PLL_ISR0) PLL of Index 2 Lock Interrupt Status Mask */
#define PMC_PLL_ISR0_LOCK2(value)             (PMC_PLL_ISR0_LOCK2_Msk & (_UINT32_(value) << PMC_PLL_ISR0_LOCK2_Pos)) /* Assigment of value for LOCK2 in the PMC_PLL_ISR0 register */
#define PMC_PLL_ISR0_UNLOCK0_Pos              _UINT32_(16)                                         /* (PMC_PLL_ISR0) PLL of Index 0 Unlock Interrupt Status Position */
#define PMC_PLL_ISR0_UNLOCK0_Msk              (_UINT32_(0x1) << PMC_PLL_ISR0_UNLOCK0_Pos)          /* (PMC_PLL_ISR0) PLL of Index 0 Unlock Interrupt Status Mask */
#define PMC_PLL_ISR0_UNLOCK0(value)           (PMC_PLL_ISR0_UNLOCK0_Msk & (_UINT32_(value) << PMC_PLL_ISR0_UNLOCK0_Pos)) /* Assigment of value for UNLOCK0 in the PMC_PLL_ISR0 register */
#define PMC_PLL_ISR0_UNLOCK1_Pos              _UINT32_(17)                                         /* (PMC_PLL_ISR0) PLL of Index 1 Unlock Interrupt Status Position */
#define PMC_PLL_ISR0_UNLOCK1_Msk              (_UINT32_(0x1) << PMC_PLL_ISR0_UNLOCK1_Pos)          /* (PMC_PLL_ISR0) PLL of Index 1 Unlock Interrupt Status Mask */
#define PMC_PLL_ISR0_UNLOCK1(value)           (PMC_PLL_ISR0_UNLOCK1_Msk & (_UINT32_(value) << PMC_PLL_ISR0_UNLOCK1_Pos)) /* Assigment of value for UNLOCK1 in the PMC_PLL_ISR0 register */
#define PMC_PLL_ISR0_UNLOCK2_Pos              _UINT32_(18)                                         /* (PMC_PLL_ISR0) PLL of Index 2 Unlock Interrupt Status Position */
#define PMC_PLL_ISR0_UNLOCK2_Msk              (_UINT32_(0x1) << PMC_PLL_ISR0_UNLOCK2_Pos)          /* (PMC_PLL_ISR0) PLL of Index 2 Unlock Interrupt Status Mask */
#define PMC_PLL_ISR0_UNLOCK2(value)           (PMC_PLL_ISR0_UNLOCK2_Msk & (_UINT32_(value) << PMC_PLL_ISR0_UNLOCK2_Pos)) /* Assigment of value for UNLOCK2 in the PMC_PLL_ISR0 register */
#define PMC_PLL_ISR0_Msk                      _UINT32_(0x00070007)                                 /* (PMC_PLL_ISR0) Register Mask  */

#define PMC_PLL_ISR0_LOCK_Pos                 _UINT32_(0)                                          /* (PMC_PLL_ISR0 Position) PLL of Index x Lock Interrupt Status */
#define PMC_PLL_ISR0_LOCK_Msk                 (_UINT32_(0x7) << PMC_PLL_ISR0_LOCK_Pos)             /* (PMC_PLL_ISR0 Mask) LOCK */
#define PMC_PLL_ISR0_LOCK(value)              (PMC_PLL_ISR0_LOCK_Msk & (_UINT32_(value) << PMC_PLL_ISR0_LOCK_Pos)) 
#define PMC_PLL_ISR0_UNLOCK_Pos               _UINT32_(16)                                         /* (PMC_PLL_ISR0 Position) PLL of Index 2 Unlock Interrupt Status */
#define PMC_PLL_ISR0_UNLOCK_Msk               (_UINT32_(0x7) << PMC_PLL_ISR0_UNLOCK_Pos)           /* (PMC_PLL_ISR0 Mask) UNLOCK */
#define PMC_PLL_ISR0_UNLOCK(value)            (PMC_PLL_ISR0_UNLOCK_Msk & (_UINT32_(value) << PMC_PLL_ISR0_UNLOCK_Pos)) 

/* -------- PMC_PLL_ISR1 : (PMC Offset: 0xF4) ( R/ 32) PLL Interrupt Status Register 1 -------- */
#define PMC_PLL_ISR1_UDR0_Pos                 _UINT32_(0)                                          /* (PMC_PLL_ISR1) PLLx Underflow Position */
#define PMC_PLL_ISR1_UDR0_Msk                 (_UINT32_(0x1) << PMC_PLL_ISR1_UDR0_Pos)             /* (PMC_PLL_ISR1) PLLx Underflow Mask */
#define PMC_PLL_ISR1_UDR0(value)              (PMC_PLL_ISR1_UDR0_Msk & (_UINT32_(value) << PMC_PLL_ISR1_UDR0_Pos)) /* Assigment of value for UDR0 in the PMC_PLL_ISR1 register */
#define PMC_PLL_ISR1_UDR1_Pos                 _UINT32_(1)                                          /* (PMC_PLL_ISR1) PLLx Underflow Position */
#define PMC_PLL_ISR1_UDR1_Msk                 (_UINT32_(0x1) << PMC_PLL_ISR1_UDR1_Pos)             /* (PMC_PLL_ISR1) PLLx Underflow Mask */
#define PMC_PLL_ISR1_UDR1(value)              (PMC_PLL_ISR1_UDR1_Msk & (_UINT32_(value) << PMC_PLL_ISR1_UDR1_Pos)) /* Assigment of value for UDR1 in the PMC_PLL_ISR1 register */
#define PMC_PLL_ISR1_UDR2_Pos                 _UINT32_(2)                                          /* (PMC_PLL_ISR1) PLLx Underflow Position */
#define PMC_PLL_ISR1_UDR2_Msk                 (_UINT32_(0x1) << PMC_PLL_ISR1_UDR2_Pos)             /* (PMC_PLL_ISR1) PLLx Underflow Mask */
#define PMC_PLL_ISR1_UDR2(value)              (PMC_PLL_ISR1_UDR2_Msk & (_UINT32_(value) << PMC_PLL_ISR1_UDR2_Pos)) /* Assigment of value for UDR2 in the PMC_PLL_ISR1 register */
#define PMC_PLL_ISR1_OVR0_Pos                 _UINT32_(16)                                         /* (PMC_PLL_ISR1) PLLx Overflow Position */
#define PMC_PLL_ISR1_OVR0_Msk                 (_UINT32_(0x1) << PMC_PLL_ISR1_OVR0_Pos)             /* (PMC_PLL_ISR1) PLLx Overflow Mask */
#define PMC_PLL_ISR1_OVR0(value)              (PMC_PLL_ISR1_OVR0_Msk & (_UINT32_(value) << PMC_PLL_ISR1_OVR0_Pos)) /* Assigment of value for OVR0 in the PMC_PLL_ISR1 register */
#define PMC_PLL_ISR1_OVR1_Pos                 _UINT32_(17)                                         /* (PMC_PLL_ISR1) PLLx Overflow Position */
#define PMC_PLL_ISR1_OVR1_Msk                 (_UINT32_(0x1) << PMC_PLL_ISR1_OVR1_Pos)             /* (PMC_PLL_ISR1) PLLx Overflow Mask */
#define PMC_PLL_ISR1_OVR1(value)              (PMC_PLL_ISR1_OVR1_Msk & (_UINT32_(value) << PMC_PLL_ISR1_OVR1_Pos)) /* Assigment of value for OVR1 in the PMC_PLL_ISR1 register */
#define PMC_PLL_ISR1_OVR2_Pos                 _UINT32_(18)                                         /* (PMC_PLL_ISR1) PLLx Overflow Position */
#define PMC_PLL_ISR1_OVR2_Msk                 (_UINT32_(0x1) << PMC_PLL_ISR1_OVR2_Pos)             /* (PMC_PLL_ISR1) PLLx Overflow Mask */
#define PMC_PLL_ISR1_OVR2(value)              (PMC_PLL_ISR1_OVR2_Msk & (_UINT32_(value) << PMC_PLL_ISR1_OVR2_Pos)) /* Assigment of value for OVR2 in the PMC_PLL_ISR1 register */
#define PMC_PLL_ISR1_Msk                      _UINT32_(0x00070007)                                 /* (PMC_PLL_ISR1) Register Mask  */

